[
    {
        "Message": "New BWCube extractor (breaking)",
        "Component": "BW Cube",
        "Product": "XtractUniversal",
        "IsBreaking": true,
        "ReleaseNote": "# Xtract Universal 5.6\n\nConfig files need to be [converted when upgrading.](https://help.theobald-software.com/en/xtract-universal/introduction/installation-and-update#upgrading-major-releases---configconverter)\n\nThere is a [knowledge base article](https://kb.theobald-software.com/cubes/bwcube-component) with some general information about the new component.\n\n## General improvements\n- Introduction of a new column name style \"Text\" that replaces the \"Use description for columns\" setting. Column names might not be unique with this style. Use at own risk.\n- Definition of runtime parameters as known from other extractors for manual filters and BEx variables\n- Introduced new runtime parameter type List\n\n## Reworked MDX Cube extraction mode\nPrevious extractions will be upgraded by our converter tool (See breaking changes)\n		\n- Updated internal structure with improvements to allow implementation of new features in the future\n- Improved extraction performance\n- Various minor bug fixes\n- New and improved GUI\n- MDX Cube extraction preview in Designer\n			\n## New BICS Cube extraction mode (BETA)\n- Replaces the previous BEx 3.x mode\n- Extraction of Infocubes and Queries using the BICS interface\n- This mode is still in beta. Use it with caution. Multiple breaking changes until final release are possible and likely\n- For using the BICS mode the user needs the [permissions as described in our knowledge base](https://kb.theobald-software.com/sap/authority-objects-sap-user-rights#bw-query--bw-cube)\n	\n## Breaking changes\n- Custom MDX mode not supported and will not be converted. Please contact our support if you are using this mode\n- BEx 3.x mode not supported and will not be converted. Please contact our support if you are using this mode\n- Column order and naming might change\n	- Corner case: combination of column name style TextAndCode or CodeAndText and \"Use description for columns\" setting will set column name style to Text\n- Converted extractions will work as before as long as they stay unchanged	\n	- Making changes to converted extractions requires a metadata refresh. After editing the new naming scheme will be used\n- Non-Unicode systems may not be compatible with the new cube component\n\n## Known issues\n- Renaming already assigned list parameters is not yet supported and will cause issues\n- BICS metadata retrieval may fail on some systems. Please send in traces if you encounter issues with metadata retrieval"
    },
    {
        "Message": "Updates to the BWCube component for increased stability, performance and compatibility.",
        "Component": "BW Cube",
        "Product": "Theobald.Extractors"
    }
]