[
    {
        "Message": "**Breaking Changes!** We have rewritten the web API and runtime to improve long term ergonomics, stability and maintainability.",
        "Component": "General",
        "Product": "XtractUniversal",
        "IsBreaking": true,
        "ReleaseNote": "## Xtract Universal 6.0.0\n\n### Breaking changes\n\n- Web API\n  - /log?req_type=all has been removed\n    - To fetch the full logs for an extraction the prefered workflow is:\n      - Get the timestamp for the extraction from the xu.exe output or the header of the HTTP response.\n      - Request the run log for the extraction with log?req_type=extraction&name=extractionname&timestamp=extractionTimestamp\n      - If that does not hold the desired information:\n        - There now is a 'WebLog' column when listing the extractions runs with log?req_type=extraction&name=extractionname\n        - Use this timestamp to request the corresponding server log for the extraction with log?req_type=server&timestamp=serverTimestamp\n  - /log?req_type=server now yields the worker instead of listener log\n  - /metadata?name=extractionName has been removed\n    - Use [json endpoint](https://help.theobald-software.com/en/xtract-universal/advanced-techniques/metadata-access-via-http-json) instead\n  - /parameters?name=extractionName has been removed\n    - Use [json endpoint](https://help.theobald-software.com/en/xtract-universal/advanced-techniques/metadata-access-via-http-json) instead\n  - /clearResultCache has been removed\n  - /CurrentVersion does now serve a json payload\n    - it also does only serve one version, since the kernel dependency was dropped\n\nWe aim to provide a more consistent and useful Web API as part of upcoming releases.\n\n### Deprecations\n\n- The 'clearBuffer' parameter for extraction requests was renamed to 'ignoreCache' and does just that instead of purging the whole cache\n  - 'clearBuffer' will be removed in a future release\n\n### Other\n\n- Web server, result cache and the engine which runs the extractions (runtime) were rewritten.\n- When running extractions the web server now responds with an HTTP error code and an error message instead of a 200 without any data or information if the SAP system yielded an error or preparing the destination failed\n  - an error while writing the data to the destination will still only show up in the logs\n- Web server authentication: HTTPS + Designer Read access is now the same as HTTPS + Anonymous if Designer access is not restricted\n  - Before one had to supply (any) Basic credentials but they were not checked."
    },
    {
        "Message": "The new runtime is now feature complete and generally available.",
        "Component": "General",
        "Product": "Theobald.Server",
        "IsBreaking": true,
        "ReleaseNote": "## Theobald Server 4.0.0\n\n- the new runtime enters general availability\n- refactoring and simplification of the new runtime\n- server code unification for running extractions against the new runtime\n- a new extraction cache for the new runtime was implemented\n- removed old HTTP server\n- the HTTP server now supports compression (gzip)\n- fixed some HTTP server bugs\n  - CORS headers did not always have the correct value\n- extractors clean up step is now correctly called after all data was processed and in any case of errors"
    }
]